ir_version: 6
producer_name: "keras2onnx+onnx_optimizer"
producer_version: "1.5.1+0.2"
model_version: 0
graph {
  name: "model_2"
  node {
    input: "TFNodes/yolo_evaluation_layer_1/arange_3/delta:0"
    output: "TFNodes/yolo_evaluation_layer_1/arange_3__51_cast_delta:0"
    name: "TFNodes/yolo_evaluation_layer_1/arange_3__51_cast_delta"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/arange_2/delta:0"
    output: "TFNodes/yolo_evaluation_layer_1/arange_2__76_cast_delta:0"
    name: "TFNodes/yolo_evaluation_layer_1/arange_2__76_cast_delta"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/arange_1/delta:0"
    output: "TFNodes/yolo_evaluation_layer_1/arange_1__148_cast_delta:0"
    name: "TFNodes/yolo_evaluation_layer_1/arange_1__148_cast_delta"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/arange/delta:0"
    output: "TFNodes/yolo_evaluation_layer_1/arange__173_cast_delta:0"
    name: "TFNodes/yolo_evaluation_layer_1/arange__173_cast_delta"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/Tile_3/multiples/3:0"
    output: "TFNodes/yolo_evaluation_layer_1/Tile_3/multiples_Unsqueeze__44:0"
    name: "TFNodes/yolo_evaluation_layer_1/Tile_3/multiples_Unsqueeze__44"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    domain: ""
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/Tile_3/multiples/2:0"
    output: "TFNodes/yolo_evaluation_layer_1/Tile_3/multiples_Unsqueeze__43:0"
    name: "TFNodes/yolo_evaluation_layer_1/Tile_3/multiples_Unsqueeze__43"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    domain: ""
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/Tile_3/multiples/1:0"
    output: "TFNodes/yolo_evaluation_layer_1/Tile_3/multiples_Unsqueeze__42:0"
    name: "TFNodes/yolo_evaluation_layer_1/Tile_3/multiples_Unsqueeze__42"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    domain: ""
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/Tile_2/multiples/3:0"
    output: "TFNodes/yolo_evaluation_layer_1/Tile_2/multiples_Unsqueeze__69:0"
    name: "TFNodes/yolo_evaluation_layer_1/Tile_2/multiples_Unsqueeze__69"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    domain: ""
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/Tile_2/multiples/2:0"
    output: "TFNodes/yolo_evaluation_layer_1/Tile_2/multiples_Unsqueeze__68:0"
    name: "TFNodes/yolo_evaluation_layer_1/Tile_2/multiples_Unsqueeze__68"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    domain: ""
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/Tile_2/multiples/0:0"
    output: "TFNodes/yolo_evaluation_layer_1/Tile_2/multiples_Unsqueeze__66:0"
    name: "TFNodes/yolo_evaluation_layer_1/Tile_2/multiples_Unsqueeze__66"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    domain: ""
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/Tile_1/multiples/3:0"
    output: "TFNodes/yolo_evaluation_layer_1/Tile_1/multiples_Unsqueeze__141:0"
    name: "TFNodes/yolo_evaluation_layer_1/Tile_1/multiples_Unsqueeze__141"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    domain: ""
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/Tile_1/multiples/2:0"
    output: "TFNodes/yolo_evaluation_layer_1/Tile_1/multiples_Unsqueeze__140:0"
    name: "TFNodes/yolo_evaluation_layer_1/Tile_1/multiples_Unsqueeze__140"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    domain: ""
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/Tile_1/multiples/1:0"
    output: "TFNodes/yolo_evaluation_layer_1/Tile_1/multiples_Unsqueeze__139:0"
    name: "TFNodes/yolo_evaluation_layer_1/Tile_1/multiples_Unsqueeze__139"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    domain: ""
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/Tile/multiples/3:0"
    output: "TFNodes/yolo_evaluation_layer_1/Tile/multiples_Unsqueeze__166:0"
    name: "TFNodes/yolo_evaluation_layer_1/Tile/multiples_Unsqueeze__166"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    domain: ""
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/Tile/multiples/2:0"
    output: "TFNodes/yolo_evaluation_layer_1/Tile/multiples_Unsqueeze__165:0"
    name: "TFNodes/yolo_evaluation_layer_1/Tile/multiples_Unsqueeze__165"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    domain: ""
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/Tile/multiples/0:0"
    output: "TFNodes/yolo_evaluation_layer_1/Tile/multiples_Unsqueeze__163:0"
    name: "TFNodes/yolo_evaluation_layer_1/Tile/multiples_Unsqueeze__163"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    domain: ""
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/Round__246"
    output: "TFNodes/yolo_evaluation_layer_1/Round__247:0"
    name: "TFNodes/yolo_evaluation_layer_1/Round__247"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/Round_1__226"
    output: "TFNodes/yolo_evaluation_layer_1/Round_1__227:0"
    name: "TFNodes/yolo_evaluation_layer_1/Round_1__227"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/Reshape_9/shape/4:0"
    output: "TFNodes/yolo_evaluation_layer_1/Reshape_9/shape_Unsqueeze__34:0"
    name: "TFNodes/yolo_evaluation_layer_1/Reshape_9/shape_Unsqueeze__34"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    domain: ""
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/Reshape_9/shape/3:0"
    output: "TFNodes/yolo_evaluation_layer_1/Reshape_9/shape_Unsqueeze__33:0"
    name: "TFNodes/yolo_evaluation_layer_1/Reshape_9/shape_Unsqueeze__33"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    domain: ""
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/Reshape_9/shape/0:0"
    output: "TFNodes/yolo_evaluation_layer_1/Reshape_9/shape_Unsqueeze__30:0"
    name: "TFNodes/yolo_evaluation_layer_1/Reshape_9/shape_Unsqueeze__30"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    domain: ""
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/Reshape_8/shape:0"
    output: "TFNodes/yolo_evaluation_layer_1/Reshape_8__59:0"
    name: "TFNodes/yolo_evaluation_layer_1/Reshape_8__59"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/Reshape_7/shape:0"
    output: "TFNodes/yolo_evaluation_layer_1/Reshape_7__84:0"
    name: "TFNodes/yolo_evaluation_layer_1/Reshape_7__84"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/Reshape_6/shape:0"
    output: "TFNodes/yolo_evaluation_layer_1/Reshape_6__9:0"
    name: "TFNodes/yolo_evaluation_layer_1/Reshape_6__9"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/Reshape_5/shape:0"
    output: "TFNodes/yolo_evaluation_layer_1/Reshape_5__217:0"
    name: "TFNodes/yolo_evaluation_layer_1/Reshape_5__217"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/Reshape_4/shape:0"
    output: "TFNodes/yolo_evaluation_layer_1/Reshape_4__267:0"
    name: "TFNodes/yolo_evaluation_layer_1/Reshape_4__267"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/Reshape_3/shape/4:0"
    output: "TFNodes/yolo_evaluation_layer_1/Reshape_3/shape_Unsqueeze__131:0"
    name: "TFNodes/yolo_evaluation_layer_1/Reshape_3/shape_Unsqueeze__131"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    domain: ""
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/Reshape_3/shape/3:0"
    output: "TFNodes/yolo_evaluation_layer_1/Reshape_3/shape_Unsqueeze__130:0"
    name: "TFNodes/yolo_evaluation_layer_1/Reshape_3/shape_Unsqueeze__130"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    domain: ""
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/Reshape_3/shape/0:0"
    output: "TFNodes/yolo_evaluation_layer_1/Reshape_3/shape_Unsqueeze__127:0"
    name: "TFNodes/yolo_evaluation_layer_1/Reshape_3/shape_Unsqueeze__127"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    domain: ""
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/Reshape_2/shape:0"
    output: "TFNodes/yolo_evaluation_layer_1/Reshape_2__156:0"
    name: "TFNodes/yolo_evaluation_layer_1/Reshape_2__156"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/Reshape_11/shape:0"
    output: "TFNodes/yolo_evaluation_layer_1/Reshape_11__95:0"
    name: "TFNodes/yolo_evaluation_layer_1/Reshape_11__95"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/Reshape_10/shape:0"
    output: "TFNodes/yolo_evaluation_layer_1/Reshape_10__266:0"
    name: "TFNodes/yolo_evaluation_layer_1/Reshape_10__266"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/Reshape_1/shape:0"
    output: "TFNodes/yolo_evaluation_layer_1/Reshape_1__181:0"
    name: "TFNodes/yolo_evaluation_layer_1/Reshape_1__181"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/Reshape/shape:0"
    output: "TFNodes/yolo_evaluation_layer_1/Reshape__10:0"
    name: "TFNodes/yolo_evaluation_layer_1/Reshape__10"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    input: "image_shape"
    output: "TFNodes/yolo_evaluation_layer_1/Squeeze:0"
    name: "TFNodes/yolo_evaluation_layer_1/Squeeze"
    op_type: "Squeeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "input_1"
    input: "W12"
    output: "convolution_output12"
    name: "conv2d_1"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/Const_2:0"
    input: "TFNodes/yolo_evaluation_layer_1/Reshape_6__9:0"
    output: "TFNodes/yolo_evaluation_layer_1/Reshape_6:0"
    name: "TFNodes/yolo_evaluation_layer_1/Reshape_6"
    op_type: "Reshape"
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/Const:0"
    input: "TFNodes/yolo_evaluation_layer_1/Reshape__10:0"
    output: "TFNodes/yolo_evaluation_layer_1/Reshape:0"
    name: "TFNodes/yolo_evaluation_layer_1/Reshape"
    op_type: "Reshape"
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/Squeeze:0"
    input: "TFNodes/yolo_evaluation_layer_1/Squeeze:0"
    output: "TFNodes/yolo_evaluation_layer_1/concat_5:0"
    name: "TFNodes/yolo_evaluation_layer_1/concat_5"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/Squeeze:0"
    input: "TFNodes/yolo_evaluation_layer_1/Squeeze:0"
    output: "TFNodes/yolo_evaluation_layer_1/concat_2:0"
    name: "TFNodes/yolo_evaluation_layer_1/concat_2"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "convolution_output12"
    input: "scale10"
    input: "bias10"
    input: "mean10"
    input: "var10"
    output: "batch_norm_output_buffer10"
    name: "batch_normalization_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999974752427e-07
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9900000095367432
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "batch_norm_output_buffer10"
    output: "model_1/leaky_re_lu_1/LeakyRelu:0"
    name: "leaky_re_lu_1"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.10000000149011612
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "model_1/leaky_re_lu_1/LeakyRelu:0"
    output: "pooling_output5"
    name: "max_pooling2d_1"
    op_type: "MaxPool"
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "ceil_mode"
      i: 0
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "pooling_output5"
    input: "W11"
    output: "convolution_output11"
    name: "conv2d_2"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "convolution_output11"
    input: "scale9"
    input: "bias9"
    input: "mean9"
    input: "var9"
    output: "batch_norm_output_buffer9"
    name: "batch_normalization_2"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999974752427e-07
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9900000095367432
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "batch_norm_output_buffer9"
    output: "model_1/leaky_re_lu_2/LeakyRelu:0"
    name: "leaky_re_lu_2"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.10000000149011612
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "model_1/leaky_re_lu_2/LeakyRelu:0"
    output: "pooling_output4"
    name: "max_pooling2d_2"
    op_type: "MaxPool"
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "ceil_mode"
      i: 0
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "pooling_output4"
    input: "W10"
    output: "convolution_output10"
    name: "conv2d_3"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "convolution_output10"
    input: "scale8"
    input: "bias8"
    input: "mean8"
    input: "var8"
    output: "batch_norm_output_buffer8"
    name: "batch_normalization_3"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999974752427e-07
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9900000095367432
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "batch_norm_output_buffer8"
    output: "model_1/leaky_re_lu_3/LeakyRelu:0"
    name: "leaky_re_lu_3"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.10000000149011612
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "model_1/leaky_re_lu_3/LeakyRelu:0"
    output: "pooling_output3"
    name: "max_pooling2d_3"
    op_type: "MaxPool"
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "ceil_mode"
      i: 0
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "pooling_output3"
    input: "W9"
    output: "convolution_output9"
    name: "conv2d_4"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "convolution_output9"
    input: "scale7"
    input: "bias7"
    input: "mean7"
    input: "var7"
    output: "batch_norm_output_buffer7"
    name: "batch_normalization_4"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999974752427e-07
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9900000095367432
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "batch_norm_output_buffer7"
    output: "model_1/leaky_re_lu_4/LeakyRelu:0"
    name: "leaky_re_lu_4"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.10000000149011612
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "model_1/leaky_re_lu_4/LeakyRelu:0"
    output: "pooling_output2"
    name: "max_pooling2d_4"
    op_type: "MaxPool"
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "ceil_mode"
      i: 0
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "pooling_output2"
    input: "W8"
    output: "convolution_output8"
    name: "conv2d_5"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "convolution_output8"
    input: "scale6"
    input: "bias6"
    input: "mean6"
    input: "var6"
    output: "batch_norm_output_buffer6"
    name: "batch_normalization_5"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999974752427e-07
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9900000095367432
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "batch_norm_output_buffer6"
    output: "model_1/leaky_re_lu_5/LeakyRelu:0"
    name: "leaky_re_lu_5"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.10000000149011612
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "model_1/leaky_re_lu_5/LeakyRelu:0"
    output: "pooling_output1"
    name: "max_pooling2d_5"
    op_type: "MaxPool"
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "ceil_mode"
      i: 0
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "pooling_output1"
    input: "W7"
    output: "convolution_output7"
    name: "conv2d_6"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "convolution_output7"
    input: "scale5"
    input: "bias5"
    input: "mean5"
    input: "var5"
    output: "batch_norm_output_buffer5"
    name: "batch_normalization_6"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999974752427e-07
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9900000095367432
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "batch_norm_output_buffer5"
    output: "model_1/leaky_re_lu_6/LeakyRelu:0"
    name: "leaky_re_lu_6"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.10000000149011612
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "model_1/leaky_re_lu_6/LeakyRelu:0"
    output: "pooling_output"
    name: "max_pooling2d_6"
    op_type: "MaxPool"
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "ceil_mode"
      i: 0
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "pooling_output"
    input: "W6"
    output: "convolution_output6"
    name: "conv2d_7"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "convolution_output6"
    input: "scale4"
    input: "bias4"
    input: "mean4"
    input: "var4"
    output: "batch_norm_output_buffer4"
    name: "batch_normalization_7"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999974752427e-07
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9900000095367432
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "batch_norm_output_buffer4"
    output: "model_1/leaky_re_lu_7/LeakyRelu:0"
    name: "leaky_re_lu_7"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.10000000149011612
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "model_1/leaky_re_lu_7/LeakyRelu:0"
    input: "W5"
    output: "convolution_output5"
    name: "conv2d_8"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "convolution_output5"
    input: "scale3"
    input: "bias3"
    input: "mean3"
    input: "var3"
    output: "batch_norm_output_buffer3"
    name: "batch_normalization_8"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999974752427e-07
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9900000095367432
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "batch_norm_output_buffer3"
    output: "model_1/leaky_re_lu_8/LeakyRelu:0"
    name: "leaky_re_lu_8"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.10000000149011612
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "model_1/leaky_re_lu_8/LeakyRelu:0"
    input: "W3"
    output: "convolution_output3"
    name: "conv2d_9"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "model_1/leaky_re_lu_8/LeakyRelu:0"
    input: "W4"
    output: "convolution_output4"
    name: "conv2d_11"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "convolution_output3"
    input: "scale1"
    input: "bias1"
    input: "mean1"
    input: "var1"
    output: "batch_norm_output_buffer1"
    name: "batch_normalization_9"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999974752427e-07
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9900000095367432
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "convolution_output4"
    input: "scale2"
    input: "bias2"
    input: "mean2"
    input: "var2"
    output: "batch_norm_output_buffer2"
    name: "batch_normalization_10"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999974752427e-07
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9900000095367432
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "batch_norm_output_buffer1"
    output: "model_1/leaky_re_lu_9/LeakyRelu:0"
    name: "leaky_re_lu_9"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.10000000149011612
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "batch_norm_output_buffer2"
    output: "model_1/leaky_re_lu_10/LeakyRelu:0"
    name: "leaky_re_lu_10"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.10000000149011612
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "model_1/leaky_re_lu_9/LeakyRelu:0"
    input: "W1"
    input: "B1"
    output: "convolution_output1"
    name: "conv2d_10"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "model_1/leaky_re_lu_10/LeakyRelu:0"
    input: "Resize_scales"
    output: "model_1/leaky_re_lu_10/LeakyRelu:0_permuted_upsampled"
    name: "Resize"
    op_type: "Resize"
    attribute {
      name: "mode"
      s: "nearest"
      type: STRING
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "convolution_output1"
    output: "transpose_output1"
    name: "Transpose4"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 2
      ints: 3
      ints: 1
      type: INTS
    }
    domain: ""
  }
  node {
    input: "model_1/leaky_re_lu_10/LeakyRelu:0_permuted_upsampled"
    input: "model_1/leaky_re_lu_5/LeakyRelu:0"
    output: "model_1/concatenate_1/concat:0"
    name: "concatenate_1"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "transpose_output1"
    output: "TFNodes/model_1/conv2d_10/BiasAdd:0"
    name: "Identity9"
    op_type: "Identity"
    doc_string: ""
    domain: ""
  }
  node {
    input: "model_1/concatenate_1/concat:0"
    input: "W2"
    output: "convolution_output2"
    name: "conv2d_12"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "TFNodes/model_1/conv2d_10/BiasAdd:0"
    output: "TFNodes/yolo_evaluation_layer_1/Shape_1:0"
    name: "TFNodes/yolo_evaluation_layer_1/Shape_1"
    op_type: "Shape"
  }
  node {
    input: "TFNodes/model_1/conv2d_10/BiasAdd:0"
    output: "TFNodes/yolo_evaluation_layer_1/Shape:0"
    name: "TFNodes/yolo_evaluation_layer_1/Shape"
    op_type: "Shape"
  }
  node {
    input: "convolution_output2"
    input: "scale"
    input: "bias"
    input: "mean"
    input: "var"
    output: "batch_norm_output_buffer"
    name: "batch_normalization_11"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999974752427e-07
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9900000095367432
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/Shape_1:0"
    output: "TFNodes/yolo_evaluation_layer_1/Shape_1__108:0"
    name: "TFNodes/yolo_evaluation_layer_1/Shape_1__108"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 6
      type: INT
    }
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/Shape:0"
    output: "TFNodes/yolo_evaluation_layer_1/Shape__183:0"
    name: "TFNodes/yolo_evaluation_layer_1/Shape__183"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 6
      type: INT
    }
  }
  node {
    input: "batch_norm_output_buffer"
    output: "model_1/leaky_re_lu_11/LeakyRelu:0"
    name: "leaky_re_lu_11"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.10000000149011612
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/Shape_1__108:0"
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_1__109"
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_1__110"
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_1__111"
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_1__112"
    output: "TFNodes/yolo_evaluation_layer_1/strided_slice_1:0"
    name: "TFNodes/yolo_evaluation_layer_1/strided_slice_1"
    op_type: "Slice"
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/Shape__183:0"
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice__184"
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice__185"
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice__186"
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice__187"
    output: "TFNodes/yolo_evaluation_layer_1/strided_slice:0"
    name: "TFNodes/yolo_evaluation_layer_1/strided_slice"
    op_type: "Slice"
  }
  node {
    input: "model_1/leaky_re_lu_11/LeakyRelu:0"
    input: "W"
    input: "B"
    output: "convolution_output"
    name: "conv2d_13"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_1:0"
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_9__113"
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_9__114"
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_9__115"
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_9__116"
    output: "TFNodes/yolo_evaluation_layer_1/strided_slice_9:0"
    name: "TFNodes/yolo_evaluation_layer_1/strided_slice_9"
    op_type: "Slice"
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_1:0"
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_7__117"
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_7__118"
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_7__119"
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_7__120"
    output: "TFNodes/yolo_evaluation_layer_1/strided_slice_7:0"
    name: "TFNodes/yolo_evaluation_layer_1/strided_slice_7"
    op_type: "Slice"
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_1:0"
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_6__122"
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_6__123"
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_6__124"
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_6__125"
    output: "TFNodes/yolo_evaluation_layer_1/strided_slice_6:0"
    name: "TFNodes/yolo_evaluation_layer_1/strided_slice_6"
    op_type: "Slice"
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_1:0"
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_5__133"
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_5__134"
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_5__135"
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_5__136"
    output: "TFNodes/yolo_evaluation_layer_1/strided_slice_5:0"
    name: "TFNodes/yolo_evaluation_layer_1/strided_slice_5"
    op_type: "Slice"
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_1:0"
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_4__143"
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_4__144"
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_4__145"
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_4__146"
    output: "TFNodes/yolo_evaluation_layer_1/strided_slice_4:0"
    name: "TFNodes/yolo_evaluation_layer_1/strided_slice_4"
    op_type: "Slice"
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_1:0"
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_3__158"
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_3__159"
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_3__160"
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_3__161"
    output: "TFNodes/yolo_evaluation_layer_1/strided_slice_3:0"
    name: "TFNodes/yolo_evaluation_layer_1/strided_slice_3"
    op_type: "Slice"
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_1:0"
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_2__168"
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_2__169"
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_2__170"
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_2__171"
    output: "TFNodes/yolo_evaluation_layer_1/strided_slice_2:0"
    name: "TFNodes/yolo_evaluation_layer_1/strided_slice_2"
    op_type: "Slice"
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice:0"
    input: "TFNodes/yolo_evaluation_layer_1/mul/y:0"
    output: "TFNodes/yolo_evaluation_layer_1/mul:0"
    name: "TFNodes/yolo_evaluation_layer_1/mul"
    op_type: "Mul"
  }
  node {
    input: "convolution_output"
    output: "transpose_output"
    name: "Transpose2"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 2
      ints: 3
      ints: 1
      type: INTS
    }
    domain: ""
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_9:0"
    output: "TFNodes/yolo_evaluation_layer_1/Cast_1:0"
    name: "TFNodes/yolo_evaluation_layer_1/Cast_1"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_7:0"
    output: "TFNodes/yolo_evaluation_layer_1/strided_slice_7__121:0"
    name: "TFNodes/yolo_evaluation_layer_1/strided_slice_7__121"
    op_type: "Squeeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_6:0"
    output: "TFNodes/yolo_evaluation_layer_1/strided_slice_6__126:0"
    name: "TFNodes/yolo_evaluation_layer_1/strided_slice_6__126"
    op_type: "Squeeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_5:0"
    output: "TFNodes/yolo_evaluation_layer_1/strided_slice_5__137:0"
    name: "TFNodes/yolo_evaluation_layer_1/strided_slice_5__137"
    op_type: "Squeeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_4:0"
    output: "TFNodes/yolo_evaluation_layer_1/strided_slice_4__147:0"
    name: "TFNodes/yolo_evaluation_layer_1/strided_slice_4__147"
    op_type: "Squeeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_3:0"
    output: "TFNodes/yolo_evaluation_layer_1/strided_slice_3__162:0"
    name: "TFNodes/yolo_evaluation_layer_1/strided_slice_3__162"
    op_type: "Squeeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_2:0"
    output: "TFNodes/yolo_evaluation_layer_1/strided_slice_2__172:0"
    name: "TFNodes/yolo_evaluation_layer_1/strided_slice_2__172"
    op_type: "Squeeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/mul:0"
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_30__188"
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_30__189"
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_30__190"
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_30__191"
    output: "TFNodes/yolo_evaluation_layer_1/strided_slice_30:0"
    name: "TFNodes/yolo_evaluation_layer_1/strided_slice_30"
    op_type: "Slice"
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/mul:0"
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_11__196"
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_11__197"
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_11__198"
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_11__199"
    output: "TFNodes/yolo_evaluation_layer_1/strided_slice_11:0"
    name: "TFNodes/yolo_evaluation_layer_1/strided_slice_11"
    op_type: "Slice"
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/mul:0"
    output: "TFNodes/yolo_evaluation_layer_1/Cast_7:0"
    name: "TFNodes/yolo_evaluation_layer_1/Cast_7"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/mul:0"
    output: "TFNodes/yolo_evaluation_layer_1/Cast_3:0"
    name: "TFNodes/yolo_evaluation_layer_1/Cast_3"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "transpose_output"
    output: "TFNodes/model_1/conv2d_13/BiasAdd:0"
    name: "Identity10"
    op_type: "Identity"
    doc_string: ""
    domain: ""
  }
  node {
    input: "TFNodes/model_1/conv2d_13/BiasAdd:0"
    output: "TFNodes/yolo_evaluation_layer_1/Shape_2:0"
    name: "TFNodes/yolo_evaluation_layer_1/Shape_2"
    op_type: "Shape"
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_7__121:0"
    output: "TFNodes/yolo_evaluation_layer_1/Reshape_3/shape_Unsqueeze__129:0"
    name: "TFNodes/yolo_evaluation_layer_1/Reshape_3/shape_Unsqueeze__129"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    domain: ""
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_6__126:0"
    output: "TFNodes/yolo_evaluation_layer_1/Reshape_3/shape_Unsqueeze__128:0"
    name: "TFNodes/yolo_evaluation_layer_1/Reshape_3/shape_Unsqueeze__128"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    domain: ""
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_5__137:0"
    output: "TFNodes/yolo_evaluation_layer_1/Tile_1/multiples_Unsqueeze__138:0"
    name: "TFNodes/yolo_evaluation_layer_1/Tile_1/multiples_Unsqueeze__138"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    domain: ""
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_4__147:0"
    input: "TFNodes/yolo_evaluation_layer_1/arange_1/start:0"
    output: "TFNodes/yolo_evaluation_layer_1/arange_1__148_diff__149:0"
    name: "TFNodes/yolo_evaluation_layer_1/arange_1__148_diff__149"
    op_type: "Sub"
    domain: ""
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_3__162:0"
    output: "TFNodes/yolo_evaluation_layer_1/Tile/multiples_Unsqueeze__164:0"
    name: "TFNodes/yolo_evaluation_layer_1/Tile/multiples_Unsqueeze__164"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    domain: ""
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_2__172:0"
    input: "TFNodes/yolo_evaluation_layer_1/arange/start:0"
    output: "TFNodes/yolo_evaluation_layer_1/arange__173_diff__174:0"
    name: "TFNodes/yolo_evaluation_layer_1/arange__173_diff__174"
    op_type: "Sub"
    domain: ""
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_30:0"
    output: "TFNodes/yolo_evaluation_layer_1/Cast_6:0"
    name: "TFNodes/yolo_evaluation_layer_1/Cast_6"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/strided_slice_11:0"
    output: "TFNodes/yolo_evaluation_layer_1/Cast_2:0"
    name: "TFNodes/yolo_evaluation_layer_1/Cast_2"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/Cast_7:0"
    input: "TFNodes/yolo_evaluation_layer_1/Squeeze:0"
    output: "TFNodes/yolo_evaluation_layer_1/truediv_10:0"
    name: "TFNodes/yolo_evaluation_layer_1/truediv_10"
    op_type: "Div"
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/Cast_3:0"
    input: "TFNodes/yolo_evaluation_layer_1/Squeeze:0"
    output: "TFNodes/yolo_evaluation_layer_1/truediv_2:0"
    name: "TFNodes/yolo_evaluation_layer_1/truediv_2"
    op_type: "Div"
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/Tile_1/multiples_Unsqueeze__138:0"
    input: "TFNodes/yolo_evaluation_layer_1/Tile_1/multiples_Unsqueeze__139:0"
    input: "TFNodes/yolo_evaluation_layer_1/Tile_1/multiples_Unsqueeze__140:0"
    input: "TFNodes/yolo_evaluation_layer_1/Tile_1/multiples_Unsqueeze__141:0"
    output: "TFNodes/yolo_evaluation_layer_1/Tile_1/multiples_Concat__142:0"
    name: "TFNodes/yolo_evaluation_layer_1/Tile_1/multiples_Concat__142"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
    domain: ""
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/Tile/multiples_Unsqueeze__163:0"
    input: "TFNodes/yolo_evaluation_layer_1/Tile/multiples_Unsqueeze__164:0"
    input: "TFNodes/yolo_evaluation_layer_1/Tile/multiples_Unsqueeze__165:0"
    input: "TFNodes/yolo_evaluation_layer_1/Tile/multiples_Unsqueeze__166:0"
    output: "TFNodes/yolo_evaluation_layer_1/Tile/multiples_Concat__167:0"
    name: "TFNodes/yolo_evaluation_layer_1/Tile/multiples_Concat__167"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
    domain: ""
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/Reshape_3/shape_Unsqueeze__127:0"
    input: "TFNodes/yolo_evaluation_layer_1/Reshape_3/shape_Unsqueeze__128:0"
    input: "TFNodes/yolo_evaluation_layer_1/Reshape_3/shape_Unsqueeze__129:0"
    input: "TFNodes/yolo_evaluation_layer_1/Reshape_3/shape_Unsqueeze__130:0"
    input: "TFNodes/yolo_evaluation_layer_1/Reshape_3/shape_Unsqueeze__131:0"
    output: "TFNodes/yolo_evaluation_layer_1/Reshape_3/shape_Concat__132:0"
    name: "TFNodes/yolo_evaluation_layer_1/Reshape_3/shape_Concat__132"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
    domain: ""
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/Shape_2:0"
    output: "TFNodes/yolo_evaluation_layer_1/Shape_2__11:0"
    name: "TFNodes/yolo_evaluation_layer_1/Shape_2__11"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 6
      type: INT
    }
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/arange_1__148_diff__149:0"
    output: "TFNodes/yolo_evaluation_layer_1/arange_1__148_cast_diff:0"
    name: "TFNodes/yolo_evaluation_layer_1/arange_1__148_cast_diff"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/arange__173_diff__174:0"
    output: "TFNodes/yolo_evaluation_layer_1/arange__173_cast_diff:0"
    name: "TFNodes/yolo_evaluation_layer_1/arange__173_cast_diff"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
    domain: ""
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/truediv_10:0"
    output: "TFNodes/yolo_evaluation_layer_1/Min_1:0"
    name: "TFNodes/yolo_evaluation_layer_1/Min_1"
    op_type: "ReduceMin"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "keepdims"
      i: 0
      type: INT
    }
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/truediv_2:0"
    output: "TFNodes/yolo_evaluation_layer_1/Min:0"
    name: "TFNodes/yolo_evaluation_layer_1/Min"
    op_type: "ReduceMin"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "keepdims"
      i: 0
      type: INT
    }
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/arange_1__148_cast_diff:0"
    input: "TFNodes/yolo_evaluation_layer_1/arange_1__148_cast_delta:0"
    output: "TFNodes/yolo_evaluation_layer_1/arange_1__148_div:0"
    name: "TFNodes/yolo_evaluation_layer_1/arange_1__148_div"
    op_type: "Div"
    domain: ""
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/arange__173_cast_diff:0"
    input: "TFNodes/yolo_evaluation_layer_1/arange__173_cast_delta:0"
    output: "TFNodes/yolo_evaluation_layer_1/arange__173_div:0"
    name: "TFNodes/yolo_evaluation_layer_1/arange__173_div"
    op_type: "Div"
    domain: ""
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/Tile_1/multiples_Concat__142:0"
    output: "TFNodes/yolo_evaluation_layer_1/Tile_1__157:0"
    name: "TFNodes/yolo_evaluation_layer_1/Tile_1__157"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/Tile/multiples_Concat__167:0"
    output: "TFNodes/yolo_evaluation_layer_1/Tile__182:0"
    name: "TFNodes/yolo_evaluation_layer_1/Tile__182"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/Reshape_3/shape_Concat__132:0"
    output: "TFNodes/yolo_evaluation_layer_1/Reshape_3__200:0"
    name: "TFNodes/yolo_evaluation_layer_1/Reshape_3__200"
    op_type: "Cast"
